module.exports.config = {
  'name': "ajan",
  'version': "2.0",
  'hasPermssion': 0x0,
  'credits': "Islamick Cyber Chat",
  'description': "সেট করা সময় অনুযায়ী স্বয়ংক্রিয়ভাবে বার্তাগুলি পাঠানো হবে!",
  'commandCategory': "AutoTime",
  'countDown': 0x3
};
module.exports.onLoad = async ({
  api: _0x4cee77
}) => {
  const _0x1aa5fa = {
    "05:35 AM": {
      'message': ". ╭•┄┅══❁🌺❁══┅┄•╮\n•—»✨ফজরের আজান✨«—•\n ╰•┄┅══❁🌺❁══┅┄•╯\n\n⋆✦⋆⎯⎯⎯⎯⎯⎯⎯⎯⎯⋆✦⋆\n আসসালামু আলাইকুম-!!🖤💫\n প্রিয় মুসলিম ভাই ও বোন এখন ফজরের আজান দেওয়া হয়েছে সবাই নামাজ এর জন্য প্রস্তুতি নিয়ে নিন আর কিছু সময় বাকি ফজর এর নামাজ শুরু হবার-!!✨🧡",
      'url': ""
    },
    "01:00 PM": {
      'message': ". ╭•┄┅══❁🌺❁══┅┄•╮\n•—»✨যোহরের আজান✨«—•\n ╰•┄┅══❁🌺❁══┅┄•╯\n\n•⋆✦⋆⎯⎯⎯⎯⎯⎯⎯⎯⎯⋆✦⋆\n আসসালামু আলাইকুম-!!🖤💫\n প্রিয় মুসলিম ভাই ও বোন এখন যোহরের আজান দেওয়া হয়েছে সবাই নামাজ এর জন্য প্রস্তুতি নিয়ে নিন আর কিছু সময় বাকি যোহরের এর নামাজ শুরু হবার-!!",
      'url': ""
    },
    "05:05 PM": {
      'message': ". ╭•┄┅══❁🌺❁══┅┄•╮\n•—»✨আসরের আজান✨«—•\n ╰•┄┅══❁🌺❁══┅┄•╯\n\n⋆✦⋆⎯⎯⎯⎯⎯⎯⎯⎯⎯⋆✦⋆\n আসসালামু আলাইকুম-!!🖤💫\n প্রিয় মুসলিম ভাই ও বোন এখন আসরের আজান দেওয়া হয়েছে সবাই নামাজ এর জন্য প্রস্তুতি নিয়ে নিন আর কিছু সময় বাকি আসর এর নামাজ শুরু হবার-!!✨🧡",
      'url': ""
    },
    "07:05 PM": {
      'message': ". ╭•┄┅══❁🌺❁══┅┄•╮\n•—»✨মাগরিবের আজান✨«—•\n ╰•┄┅══❁🌺❁══┅┄•╯\n\n⋆✦⋆⎯⎯⎯⎯⎯⎯⎯⎯⎯⋆✦⋆\n আসসালামু আলাইকুম-!!🖤💫\n প্রিয় মুসলিম ভাই ও  এখন মাগরিবের আজান দেওয়া হয়েছে সবাই নামাজ এর জন্য প্রস্তুতি নিয়ে নিন আর কিছু সময় বাকি মাগরিবের নামাজ শুরু হবার-!!✨🧡",
      'url': ""
    },
    "08:15 PM": {
      'message': "╭•┄┅══❁🌺❁══┅┄•╮\n•—»✨ইশা আজান✨«—•\n╰•┄┅══❁🌺❁══┅┄•╯\n\n⋆✦⋆⎯⎯⎯⎯⎯⎯⎯⎯⎯⋆✦⋆\n আসসালামু আলাইকুম-!!🖤💫\n প্রিয় মুসলিম ভাই ও  এখন ইশা আজান দেওয়া হয়েছে সবাই নামাজ এর জন্য প্রস্তুতি নিয়ে নিন আর কিছু সময় বাকি ইশারের নামাজ শুরু হবার-!!✨🧡",
      'url': ""
    }
  };
  const _0x5c48f9 = async () => {
    const _0x81b199 = new Date(Date.now() + 21600000).toLocaleTimeString("en-US", {
      'hour': "2-digit",
      'minute': "2-digit",
      'hour12': true
    }).split(',').pop().trim();
    if (_0x1aa5fa[_0x81b199]) {
      console.log(_0x1aa5fa[_0x81b199].message);
      console.log(_0x1aa5fa[_0x81b199].url);
      try {
        let _0x43ee23 = {
          'body': _0x1aa5fa[_0x81b199].message,
          'attachment': null
        };
        global.data.allThreadID.forEach(_0x30683f => _0x4cee77.sendMessage(_0x43ee23, _0x30683f));
      } catch (_0x1a816f) {
        console.error("Failed to send message for time " + _0x81b199 + ':', _0x1a816f);
      }
    }
    setTimeout(_0x5c48f9, 45000);
  };
  _0x5c48f9();
};
module.exports.run = ({}) => {};
