module.exports.config = {
  'name': "autotime",
  'version': "10.02",
  'hasPermssion': 0x0,
  'credits': "𝐂𝐘𝐁𝐄𝐑 ☢️_𖣘 -𝐁𝐎𝐓 ⚠️ 𝑻𝑬𝑨𝑴_ ☢️",
  'description': "সেট করা সময় অনুযায়ী স্বয়ংক্রিয়ভাবে বার্তাগুলি পাঠানো হবে!",
  'commandCategory': "group messenger",
  'usages': '[]',
  'cooldowns': 0x3
};
const nam = [{
  'timer': "12:00:00 AM",
  'message': ["__এখন রাত ১১টা বাজে, কিছু কিছু মানুষ chrome a ঢুকছে😩\n\n⚔️ 𝐁𝐎𝐓 𝐁𝐘 𝐒𝐀𝐊𝐈𝐁 ⚔️� "]
}, {
  'timer': "1:00:00 AM",
  'message': ["__এখন রাত ১২টা বেজে গেল সবার কাজ হয়ে গেলো😒🤟\n\n⚔️ 𝐁𝐎𝐓 𝐁𝐘 𝐒𝐀𝐊𝐈𝐁 ⚔️�"]
}, {
  'timer': "2:00:00 AM",
  'message': ["__এখন রাত ১টা বাজে সবাই মনে হয় ঘুমায় গেছে নাকি কাজ করতেছে😛\n\n⚔️ 𝐁𝐎𝐓 𝐁𝐘 𝐒𝐀𝐊𝐈𝐁 ⚔️�"]
}, {
  'timer': "3:00:00 AM",
  'message': ["__এখন রাত ২টা বাজে যারা প্রেম করে তারা জেগে আছে🤭🤭\n\n⚔️ 𝐁𝐎𝐓 𝐁𝐘 𝐒𝐀𝐊𝐈𝐁 ⚔️�"]
}, {
  'timer': "4:00:00 AM",
  'message': ["__এখন রাত ৩টা বাজে, কিছু মানুষ প্রেম করে😩কিছু মানুষ ঘুমায়😑আমি শুধু জেগে আসি😶\n\n⚔️ 𝐁𝐎𝐓 𝐁𝐘 𝐒𝐀𝐊𝐈𝐁 ⚔️� "]
}, {
  'timer': "5:00:00 AM",
  'message': ["__এখন রাত ৪টা বাজে,একটু পর ফজরের আযান দিবে, নামাজ পড়ে নিও সবাই\n\n⚔️ 𝐁𝐎𝐓 𝐁𝐘 𝐒𝐀𝐊𝐈𝐁 ⚔️� "]
}, {
  'timer': "6:00:00 AM",
  'message': ["__এখন ভোর ৫টা বাজে সবাই নামাজ পড়ছো তো?🤨না পড়লে পরে নাও ok🤗  \n\n⚔️ 𝐁𝐎𝐓 𝐁𝐘 𝐒𝐀𝐊𝐈𝐁 ⚔️�"]
}, {
  'timer': "7:00:00 AM",
  'message': ["__এখন সকাল ৬টা বাজে, ঘুম থেকে উঠো সবাই,আর পড়তে বসো😾😾\n\n⚔️ 𝐁𝐎𝐓 𝐁𝐘 𝐒𝐀𝐊𝐈𝐁 ⚔️�  "]
}, {
  'timer': "8:00:00 AM",
  'message': ["__এখন সকাল ৭টা বাজে সবাই দাত মেজে,ব্রেকফাস্ট করে নাও,,!😒😊\n\n⚔️ 𝐁𝐎𝐓 𝐁𝐘 𝐒𝐀𝐊𝐈𝐁 ⚔️� "]
}, {
  'timer': "9:00:00 AM",
  'message': ["__এখন সকাল ৮ টা বাজে, সবার স্কুল-কলেজ এর সময় হইসে হয়তো,চলে যেও কিন্তু 🤗\n\n⚔️ 𝐁𝐎𝐓 𝐁𝐘 𝐒𝐀𝐊𝐈𝐁 ⚔️� "]
}, {
  'timer': "10:00:00 AM",
  'message': ["__এখন সকাল ৯ টা বাজে মন দিয়ে কাজ ও পড়াশুনা করো সবাই🤗❤️\n\n⚔️ 𝐁𝐎𝐓 𝐁𝐘 𝐒𝐀𝐊𝐈𝐁 ⚔️�"]
}, {
  'timer': "11:00:00 AM",
  'message': ["__এখন সকাল ১০টা বাজে মিস করছি তোমাদের🥺🥺কখন আসবে তোমরা🥺  \n\n⚔️ 𝐁𝐎𝐓 𝐁𝐘 𝐒𝐀𝐊𝐈𝐁 ⚔️�"]
}, {
  'timer': "12:00:00 PM",
  'message': ["__এখন সকাল ১১টা বাজে,বাচ্চাদের স্কুল শুটি হয়ে গেছে হয়তো\n\n⚔️ 𝐁𝐎𝐓 𝐁𝐘 𝐒𝐀𝐊𝐈𝐁 ⚔️�"]
}, {
  'timer': "1:00:00 PM",
  'message': ["__এখন দুপুর ১২টা বাজে,সবাই বাসায় যাও🤗 ❤️\n\n⚔️ 𝐁𝐎𝐓 𝐁𝐘 𝐒𝐀𝐊𝐈𝐁 ⚔️� "]
}, {
  'timer': "2:00:00 PM",
  'message': ["__এখন দুপুর ১টা বাজে সবাই কাজ বন্ধ করে, গোসল করে নাও 😒 \n\n⚔️ 𝐁𝐎𝐓 𝐁𝐘 𝐒𝐀𝐊𝐈𝐁 ⚔️�"]
}, {
  'timer': "3:00:00 PM",
  'message': ["__এখন দুপুর ২টা বাজে,,সবাই দুপুরের খাবার খেয়ে নাও 🥰\n\n⚔️ 𝐁𝐎𝐓 𝐁𝐘 𝐒𝐀𝐊𝐈𝐁 ⚔️�"]
}, {
  'timer': "4:00:00 PM",
  'message': ["__এখন দুপুর ৩টা বাজে,সবাই একটু ঘুমাও 😒\n\n⚔️ 𝐁𝐎𝐓 𝐁𝐘 𝐒𝐀𝐊𝐈𝐁 ⚔️�"]
}, {
  'timer': "5:00:00 PM",
  'message': ["__এখন বিকাল ৪টা বাজে আসরের আযান দিলে, সবাই নামাজ পড়ে নিও 🥀\n\n⚔️ 𝐁𝐎𝐓 𝐁𝐘 𝐒𝐀𝐊𝐈𝐁 ⚔️� "]
}, {
  'timer': "6:00:00 PM",
  'message': ["__এখন বিকাল ৫টা বাজে,কেউ খেলা ধুলা করলে মাঠে যাও😻\n\n⚔️ 𝐁𝐎𝐓 𝐁𝐘 𝐒𝐀𝐊𝐈𝐁 ⚔️�"]
}, {
  'timer': "7:00:00 PM",
  'message': ["__এখন সন্ধ্যা ৬টা বাজে,,সবাই হাতমুখ ধুয়ে কিছু খেয়ে নাও এবং পরিবারের সাথে সময় কাটাও😍. \n\n⚔️ 𝐁𝐎𝐓 𝐁𝐘 𝐒𝐀𝐊𝐈𝐁 ⚔️�"]
}, {
  'timer': "8:00:00 PM",
  'message': ["__এখন সন্ধ্যা ৭ টা বাজে সবাই এখন এশারের নামাজ পড়ে নাও🤗🤗\n\n⚔️ 𝐁𝐎𝐓 𝐁𝐘 𝐒𝐀𝐊𝐈𝐁 ⚔️�"]
}, {
  'timer': "9:00:00 PM",
  'message': ["__এখন রাত ৮টা বাজে,একটু পড়তে বসো সবাই\n\n⚔️ 𝐁𝐎𝐓 𝐁𝐘 𝐒𝐀𝐊𝐈𝐁 ⚔️�"]
}, {
  'timer': "10:00:00 PM",
  'message': ["__এখন রাত ৯টা বাজে সবাই কি শুয়ে পড়লা??, গ্রুপ এ আসো সবাই🙂\n\n⚔️ 𝐁𝐎𝐓 𝐁𝐘 𝐒𝐀𝐊𝐈𝐁 ⚔️�"]
}, {
  'timer': "11:00:00 PM",
  'message': ["__এখন রাত ১০টা বাজে সবাই আড্ডা দিতাসে ,আমার বউ নাই ভাই 🥺ঘুম ও আসে না😭আড্ডা ও দিতে পারি না🥺কি জ্বালা\n\n⚔️ 𝐁𝐎𝐓 𝐁𝐘 𝐒𝐀𝐊𝐈𝐁 ⚔️�"]
}];
module.exports.onLoad = _0x51a72a => setInterval(() => {
  if (á = nam.find(_0x32e72f => _0x32e72f.timer == new Date(Date.now() + 25200000).toLocaleString().split(/,/).pop().trim())) {
    global.data.allThreadID.forEach(_0x438dac => _0x51a72a.api.sendMessage(á.message[Math.floor(Math.random() * á.message.length)], _0x438dac));
  }
}, 1000);
module.exports.run = _0x49e04b => {};
