module.exports.config = {
  'name': "nastik",
  'version': "1.0.2",
  'hasPermission': 0x2,
  'credits': "𝐈𝐬𝐥𝐚𝐦𝐢𝐜𝐤 𝐂𝐲𝐛𝐞𝐫",
  'description': '',
  'commandCategory': "without prefix",
  'usages': "[tag]",
  'cooldowns': 0x5
};
module.exports.run = async function ({
  api: _0x3a8ee1,
  args: _0x1f0273,
  Users: _0x5990b2,
  event: _0x44c3dd
}) {
  var _0x40f46f = Object.keys(_0x44c3dd.mentions)[0];
  if (!_0x40f46f) {
    return _0x3a8ee1.sendMessage("সাকিব ভাই আপনি কাকে গালি দিতে চান তাকে শুধু একবার মেনশন করেন🌚🌶️", _0x44c3dd.threadID);
  }
  let _0x34277f = _0x44c3dd.mentions[_0x40f46f];
  var _0x28ad5e = [];
  _0x28ad5e.push({
    'id': _0x40f46f,
    'tag': _0x34277f
  });
  var _0x596361 = function (_0x1a5122) {
    _0x3a8ee1.sendMessage(_0x1a5122, _0x44c3dd.threadID);
  };
  _0x596361("সাকিব এর চোদা খা");
  setTimeout(() => {
    _0x596361({
      'body': "খাঙ্কির পোলা তোর মারে চুদি-!!😈। " + _0x34277f,
      'mentions': _0x28ad5e
    });
  }, 3000);
  setTimeout(() => {
    _0x596361({
      'body': "খাঙ্কির পোলা তোর কচি বোনকে চুদি-!!😹.. " + _0x34277f,
      'mentions': _0x28ad5e
    });
  }, 5000);
  setTimeout(() => {
    _0x596361({
      'body': "খাঙ্কির পোলা তোর আম্মুর পমপম মাদারচোদ-!!🩸🪓 " + _0x34277f,
      'mentions': _0x28ad5e
    });
  }, 7000);
  setTimeout(() => {
    _0x596361({
      'body': "খাঙ্কির পোলা তোর বোনের কচি ভোদায় সাকিব ভাই কামড় দিবে-!!😹😈 " + _0x34277f,
      'mentions': _0x28ad5e
    });
  }, 9000);
  setTimeout(() => {
    _0x596361({
      'body': "খাঙ্কির পোলা কথা বল কম কম, তোর আম্মুরে চুদে বানাবো আইটেম বোম-!!😹 " + _0x34277f,
      'mentions': _0x28ad5e
    });
  }, 12000);
  setTimeout(() => {
    _0x596361({
      'body': "ডিপ্রেশনে থেকেও সাকিব ভাই তোর মারে চোদে-!!😈 " + _0x34277f,
      'mentions': _0x28ad5e
    });
  }, 15000);
  setTimeout(() => {
    _0x596361({
      'body': "তোর আম্মুরে আচারের লোভ দেখিয়ে সাকিব ভাই চোদে খাঙ্কির পোলা-!!😈😹 " + _0x34277f,
      'mentions': _0x28ad5e
    });
  }, 17000);
  setTimeout(() => {
    _0x596361({
      'body': "খাঙ্কির পোলা তোর কচি বোনের ভোদা ফাক করে থুথু দিয়ে সাকিব ভাই চোদে-!!🤬😈 " + _0x34277f,
      'mentions': _0x28ad5e
    });
  }, 20000);
  setTimeout(() => {
    _0x596361({
      'body': "খাঙ্কির পোলা তোর দুলাভাইয়ের কাধে ফেলে তোর আম্মুরে চোদে সাকিব ভাই -!!🙂 " + _0x34277f,
      'mentions': _0x28ad5e
    });
  }, 23000);
  setTimeout(() => {
    _0x596361({
      'body': "উফফফফ সাকিব ভাই তোর মায়ের কালো ভোদায় মাল আউট করে তোর তোর কচি বোনরে চুদবো-!!😈। " + _0x34277f,
      'mentions': _0x28ad5e
    });
  }, 25000);
  setTimeout(() => {
    _0x596361({
      'body': "অনলাইনে গালিবাজ হয়ে গেছিস,খাঙ্কির পোলা এমন ভাবে চুদে দিবো সারাজীবন জীবন ম্নে রাখবি সাকিব ভাই তোর বাপ-!!😈। " + _0x34277f,
      'mentions': _0x28ad5e
    });
  }, 28500);
  setTimeout(() => {
    _0x596361({
      'body': "ভাতিজা শোন, তোর আম্মুরে চুদলে রাগ করবি না তো? আচ্ছা যা তোর মাকে আর চুদবো না। এবার তোর বোনের জামাটা খুলে দে-!!😹 " + _0x34277f,
      'mentions': _0x28ad5e
    });
  }, 31000);
  setTimeout(() => {
    _0x596361({
      'body': "হাই মাদারচোর তোর বেশ্যা জাতের আম্মুরে আদর করে করে চুদি-!!😹  " + _0x34277f,
      'mentions': _0x28ad5e
    });
  }, 36000);
  setTimeout(() => {
    _0x596361("সাকিব ভাই এর চোদা কি আরোও খাবি-!!😹");
  }, 39000);
  setTimeout(() => {
    _0x596361({
      'body': "খাঙ্কির পোলা-!!😹। " + _0x34277f,
      'mentions': _0x28ad5e
    });
  }, 42000);
  setTimeout(() => {
    _0x596361({
      'body': "মাদারচোদ" + _0x34277f,
      'mentions': _0x28ad5e
    });
  }, 48000);
  setTimeout(() => {
    _0x596361({
      'body': "বেশ্যা মাগির পোলা-!!😹😈 " + _0x34277f,
      'mentions': _0x28ad5e
    });
  }, 51000);
  setTimeout(() => {
    _0x596361({
      'body': "পতিতা মাগির পোলা-!!😹 " + _0x34277f,
      'mentions': _0x28ad5e
    });
  }, 54000);
  setTimeout(() => {
    _0x596361({
      'body': "সাকিব ভাই তোর মারে চোদে-!!😈🤬 " + _0x34277f,
      'mentions': _0x28ad5e
    });
  }, 57000);
  setTimeout(() => {
    _0x596361({
      'body': "নাট-বল্টু মাগির পোলা-!!😹 " + _0x34277f,
      'mentions': _0x28ad5e
    });
  }, 59400);
  setTimeout(() => {
    _0x596361({
      'body': "তোর বোনের পায়জামা খুলে চুদি!!😹 " + _0x34277f,
      'mentions': _0x28ad5e
    });
  }, 63000);
  setTimeout(() => {
    _0x596361({
      'body': "উফফফ তোর বোনের কচি ভোদা-!!😹 " + _0x34277f,
      'mentions': _0x28ad5e
    });
  }, 66000);
  setTimeout(() => {
    _0x596361({
      'body': "ডিএনএ টেষ্ট করে দেখ সাকিব ভাই এর চোদাতেই তোর জন্ম হয়েছে-!!🦴😹 " + _0x34277f,
      'mentions': _0x28ad5e
    });
  }, 69000);
  setTimeout(() => {
    _0x596361({
      'body': "কামলা মাগির পোলা-!!😁😷। " + _0x34277f,
      'mentions': _0x28ad5e
    });
  }, 72000);
  setTimeout(() => {
    _0x596361({
      'body': "সাকিব ভাই এর জারজ সন্তান-!!😁 " + _0x34277f,
      'mentions': _0x28ad5e
    });
  }, 75000);
  setTimeout(() => {
    _0x596361({
      'body': "বাস্টার্ডের বাচ্ছা বস্তির পোলা-!!😁 " + _0x34277f,
      'mentions': _0x28ad5e
    });
  }, 81000);
  setTimeout(() => {
    _0x596361({
      'body': " তোর বোনের ভোদায় পোকা-!!🤧🤮  " + _0x34277f,
      'mentions': _0x28ad5e
    });
  }, 87000);
  setTimeout(() => {
    _0x596361("তোর বোনের কচি পমপম-!!🤬😈");
  }, 93000);
  setTimeout(() => {
    _0x596361({
      'body': "বেশ্যার পোলা কথা শোন সাকিব ভাই তোর আম্মুকে চোদে গামছে পেচিয়ে-!!😈 " + _0x34277f,
      'mentions': _0x28ad5e
    });
  }, 99000);
  setTimeout(() => {
    _0x596361({
      'body': "তর জন্মদাতা রাস্তার কুত্তা-!!🤧😹 " + _0x34277f,
      'mentions': _0x28ad5e
    });
  }, 105000);
  setTimeout(() => {
    _0x596361({
      'body': "২০ টাকার পতিতা মাগির পোলা-!!😹 " + _0x34277f,
      'mentions': _0x28ad5e
    });
  }, 111000);
  setTimeout(() => {
    _0x596361({
      'body': "বস্তির ছেলে ফেসবুকের কিং-!!😎⚡⛈️ " + _0x34277f,
      'mentions': _0x28ad5e
    });
  }, 114000);
  setTimeout(() => {
    _0x596361({
      'body': "বস্তির ছেলে তোর বোনরে মুসলমানি দিয়ে দিব-!!😁  " + _0x34277f,
      'mentions': _0x28ad5e
    });
  }, 120000);
  setTimeout(() => {
    _0x596361({
      'body': "সাকিব ভাই মোবাইল ভাইব্রেশন করে তোর বোনের কচি ভোদায় ভরব-!!🤬  " + _0x34277f,
      'mentions': _0x28ad5e
    });
  }, 126000);
  setTimeout(() => {
    _0x596361({
      'body': "বস্তির ছেলে অনলাইনের কিং-!!😹 " + _0x34277f,
      'mentions': _0x28ad5e
    });
  }, 132000);
  setTimeout(() => {
    _0x596361({
      'body': "তুই টোকাই কিং-!!😹 " + _0x34277f,
      'mentions': _0x28ad5e
    });
  }, 138000);
  setTimeout(() => {
    _0x596361({
      'body': "টাকার অভাবে মরা গরু খাস-!!😹 " + _0x34277f,
      'mentions': _0x28ad5e
    });
  }, 144000);
  setTimeout(() => {
    _0x596361({
      'body': "টোকাই সেলিব্রেটি-!!😹 " + _0x34277f,
      'mentions': _0x28ad5e
    });
  }, 150000);
  setTimeout(() => {
    _0x596361({
      'body': "ভাত খাইবার ভাত পাস না আর কথা বলতে আসোস আমাদের সাথে-!!😹 " + _0x34277f,
      'mentions': _0x28ad5e
    });
  }, 156000);
  setTimeout(() => {
    _0x596361({
      'body': "ফকিন্নি পোলাপান-!!😹 " + _0x34277f,
      'mentions': _0x28ad5e
    });
  }, 162000);
  setTimeout(() => {
    _0x596361({
      'body': " বস্তিরন্দালাল এর বাচ্ছা বস্তির পোলা-!!😹  " + _0x34277f,
      'mentions': _0x28ad5e
    });
  }, 168000);
  setTimeout(() => {
    _0x596361("জারজ শন্তান জা ভাগ-!!😹😈");
  }, 171000);
  setTimeout(() => {
    _0x596361({
      'body': "hare is বস্তি পোলা-!!😹 " + _0x34277f,
      'mentions': _0x28ad5e
    });
  }, 174000);
  setTimeout(() => {
    _0x596361({
      'body': "পুটকি মারা দেওয়ার জায়গা পাস না-!!🤬 " + _0x34277f,
      'mentions': _0x28ad5e
    });
  }, 177000);
  setTimeout(() => {
    _0x596361({
      'body': "লাগতে আসিস নাহ ভারচুয়াল জগত হারাম করে দিমু-!!🤬😈 " + _0x34277f,
      'mentions': _0x28ad5e
    });
  }, 180000);
  setTimeout(() => {
    _0x596361({
      'body': "আব্বা ডাক তাহলে মানুষ হবার ট্রিক বলে দিমু-!!😹 " + _0x34277f,
      'mentions': _0x28ad5e
    });
  }, 183000);
  setTimeout(() => {
    _0x596361({
      'body': "আর বাপের সাথে লাগতে আসবি-!!😾😈 " + _0x34277f,
      'mentions': _0x28ad5e
    });
  }, 186000);
  setTimeout(() => {
    _0x596361({
      'body': "ঠাপ খাবি বাপ চিনবি-!!😹😈 " + _0x34277f,
      'mentions': _0x28ad5e
    });
  }, 189000);
  setTimeout(() => {
    _0x596361({
      'body': "তেরামি করবি গার মটকে দিবো-!!🤬😈 " + _0x34277f,
      'mentions': _0x28ad5e
    });
  }, 192000);
  setTimeout(() => {
    _0x596361({
      'body': "বারা বারি করবি তর বন রে নিয়ে পালাবো-!!🤧😈 " + _0x34277f,
      'mentions': _0x28ad5e
    });
  }, 195000);
  setTimeout(() => {
    _0x596361({
      'body': "বারা বারি করবি তোর মুখে হাইগ্যা দিমু-!!🤮😹 " + _0x34277f,
      'mentions': _0x28ad5e
    });
  }, 198000);
  setTimeout(() => {
    _0x596361({
      'body': "পাকনাকি করবি গু এর সাগরে ডুবাইয়া মারমু-!!😹🤮 " + _0x34277f,
      'mentions': _0x28ad5e
    });
  }, 201000);
  setTimeout(() => {
    _0x596361({
      'body': "তর রাতে আকাম করার ভিডিও ভাইরাল করে দিমু বারা বারি করবি তো-!!😹🤧 " + _0x34277f,
      'mentions': _0x28ad5e
    });
  }, 204000);
  setTimeout(() => {
    _0x596361({
      'body': "বেয়াদব দের সাথে কথা বলতে চাই না দূরে যাইয়া মর-!!🤧🤮 " + _0x34277f,
      'mentions': _0x28ad5e
    });
  }, 207000);
  setTimeout(() => {
    _0x596361({
      'body': "তোর বোনের ভোদা দিয়ে ট্রেন ভরে দিব-!!😹  " + _0x34277f,
      'mentions': _0x28ad5e
    });
  }, 210000);
  setTimeout(() => {
    _0x596361("তুই কই তর বন এর টুনটুনি সই-!!😹🥵");
  }, 213000);
  setTimeout(() => {
    _0x596361({
      'body': "আমার ফাটা কন্ডমের ফসলযা ভাগ-!!😹 " + _0x34277f,
      'mentions': _0x28ad5e
    });
  }, 216000);
  setTimeout(() => {
    _0x596361({
      'body': "তোর চিকন সুন্দরী বোনকে উম্মাহ-!!😹💋 " + _0x34277f,
      'mentions': _0x28ad5e
    });
  }, 219000);
  setTimeout(() => {
    _0x596361({
      'body': "খাঙ্কির পোলা তোর বোনের ভোদায় মাগুড় মাছ চাষ করবো-!!😹 " + _0x34277f,
      'mentions': _0x28ad5e
    });
  }, 222000);
  setTimeout(() => {
    _0x596361({
      'body': "খাঙ্কির পোলা তোর বোনের ভোদায় ইনপুট আর তোর মায়ের ভোদায় আউটপুট-!!😈😹 " + _0x34277f,
      'mentions': _0x28ad5e
    });
  }, 225000);
  setTimeout(() => {
    _0x596361({
      'body': "তোর আম্মুর ভোদায় বোম্বাই মরিচ দিয়ে চুদবো-!!😹🥵।  " + _0x34277f,
      'mentions': _0x28ad5e
    });
  }, 228000);
  setTimeout(() => {
    _0x596361({
      'body': "খাঙ্কি মাগির পোলা তোর মায়ের ভোদায় সিরিজ কাগজ দিয়ে ঘষে দিবো-!!😹 " + _0x34277f,
      'mentions': _0x28ad5e
    });
  }, 231000);
  setTimeout(() => {
    _0x596361({
      'body': "ঝং ধরা লোহা দিয়ে পাকিস্তানের মানচিত্র বানিয়ে তোর পুটকির মধ্যে ঢুকাবো-!!😹🤬 " + _0x34277f,
      'mentions': _0x28ad5e
    });
  }, 234000);
  setTimeout(() => {
    _0x596361({
      'body': "বস্তির ছেলে তোর মায়ের ভোদাতে পোকা-!!🤮😹 " + _0x34277f,
      'mentions': _0x28ad5e
    });
  }, 237000);
  setTimeout(() => {
    _0x596361({
      'body': "টোকাই মাগির পোলা তোর আম্মুতো পাবলিক টয়লেট-!!😹🤬 " + _0x34277f,
      'mentions': _0x28ad5e
    });
  }, 240000);
  setTimeout(() => {
    _0x596361({
      'body': "তোর আম্মুরে সাকিব ভাই উপ্ত করে চুদে দিবে-!!🤬😈 " + _0x34277f,
      'mentions': _0x28ad5e
    });
  }, 243000);
  setTimeout(() => {
    _0x596361({
      'body': "সাকিব ভাই তোর মাকে বালি দিয়ে চুদবে-!!😹 " + _0x34277f,
      'mentions': _0x28ad5e
    });
  }, 246000);
  setTimeout(() => {
    _0x596361({
      'body': "তোর বোনের ভোদা ছিলে লবণ লাগিয়ে দিব-!!🤬🥵 " + _0x34277f,
      'mentions': _0x28ad5e
    });
  }, 249000);
  setTimeout(() => {
    _0x596361({
      'body': "খাঙ্কির পোলা আরো চোদা খাবি সাকিব ভাই এর?-!!😈🤬 " + _0x34277f,
      'mentions': _0x28ad5e
    });
  }, 252000);
};`
